KASTORPROJECT/src/Catalogs/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сотрудники</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусДоступа</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПриема</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Уволен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУвольнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛогинAD</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

KASTORPROJECT/src/Catalogs/Сотрудники/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура СформироватьФИО()
    Объект.Наименование = СокрЛП(Объект.Фамилия + " " + Объект.Имя + " " + Объект.Отчество);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
    Если Не ЗначениеЗаполнено(Объект.Наименование) Тогда
        СформироватьФИО();
    КонецЕсли;
    
    УправлениеВидимостьюДоступностью();
   КонецПроцедуры

&НаКлиенте
Процедура ФамилияПриИзменении(Элемент)
    СформироватьФИО();
КонецПроцедуры

&НаКлиенте
Процедура ИмяПриИзменении(Элемент)
    СформироватьФИО();
КонецПроцедуры

&НаКлиенте
Процедура ОтчествоПриИзменении(Элемент)
    СформироватьФИО();
КонецПроцедуры

&НаКлиенте
Процедура УволенПриИзменении(Элемент)
    УправлениеВидимостьюДоступностью();
КонецПроцедуры

&НаКлиенте
Процедура ДатаУвольненияПриИзменении(Элемент)
   Если НЕ ЗначениеЗаполнено(Объект.ДатаУвольнения) Тогда
		Объект.Уволен = Ложь;
		УправлениеВидимостьюДоступностью();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УправлениеВидимостьюДоступностью()
    Элементы.ДатаУвольнения.Видимость = Объект.Уволен;
	
	Если Объект.Уволен Тогда
		Если НЕ ЗначениеЗаполнено(Объект.ДатаУвольнения) Тогда
			Объект.ДатаУвольнения = ДатаСеанса(); 
		КонецЕсли;
	Иначе
		Объект.ДатаУвольнения = '00010101';
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ДатаСеанса() Экспорт
	
	Возврат ТекущаяДатаСеанса();
	
КонецФункции
